Tekla.Structures.Model.Contour
The Contour class defines a possibly chamfered contour. Contours must not have loops.

Tekla.Structures.Model.Contour.MAX_CONTOUR_POINTS
The maximum number of contour points that is typically valid in Tekla Structures.

Tekla.Structures.Model.Contour.MIN_CONTOUR_POINTS
The minimum number of contour points that is typically valid in Tekla Structures.

Tekla.Structures.Model.Contour.OLD_MAX_CONTOUR_POINTS
The old maximum contour points

Tekla.Structures.Model.Contour.MAX_POLYBEAM_POINTS
The maximum polybeam points

Tekla.Structures.Model.Contour._ContourPoints
The contour points

Tekla.Structures.Model.Contour.ContourPoints
The contour points belonging to the contour.

Tekla.Structures.Model.Contour.#ctor
Instantiates an empty contour.

Tekla.Structures.Model.Contour.AddContourPoint(Tekla.Structures.Model.ContourPoint)
Adds a new contour point to the contour. Do not add the same contour point twice.
Point: The contour point to add.

Tekla.Structures.Model.Contour.CalculatePolygon(Tekla.Structures.Model.Polygon@)
Calculate a polygon approximating the contour with chamfers evaluated.
polygon: The calculated Tekla.Structures.Model.Polygon.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.Contour.GetPolycurve
Gets the contour geometry as Polycurve
Returns: Polycurve

Tekla.Structures.Model.Contour.ToList(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t}@)
Exports contour points to the list to transfer to core.
contour: The contour points.

Tekla.Structures.Model.Contour.FromList(System.Collections.Generic.List{Tekla.Structures.ModelInternal.dotContourPoint_t})
Imports contour points from the list.
contour: The contour points.